ПД_sev/src/Documents/СчетПоставщика/СчетПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетПоставщика</name>
  <basedOn>Document.СчетПокупателя</basedOn>
  <basedOn>Catalog.Проекты</basedOn>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ПрибыльПоПроектам</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСФ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПД_sev/src/Documents/СчетПоставщика/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Организация = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеКонстанты("УПОсновнаяОрганизация");
		Объект.Оплачен = Истина;
	КонецЕсли;	
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	ПолучитьДанныеПоТоваруИзFMКлиент();
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоТоваруИзFMКлиент() Экспорт
	РезультатВыполнения = ПолучитьТаблицуТоваровВФоне();
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
 	ПараметрыОжидания.Интервал = 2;	    
    ДлительныеОперацииКлиент.ОжидатьЗавершение(
        РезультатВыполнения,
        Новый ОписаниеОповещения("ОбработатьПолучениеТаблицыТоваровКлиент", ЭтотОбъект),
        ПараметрыОжидания);		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолучениеТаблицыТоваровКлиент(Результат, ДополнительныеПараметры) Экспорт
	ОбработатьПолучениеТаблицыТоваровСервер(Результат, ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолучениеТаблицыТоваровСервер(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат.Статус = "Ошибка" Тогда
		Сообщить(Результат.КраткоеПредставлениеОшибки);
		Возврат
	КонецЕсли;
	ТаблицаFM = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	ЗначениеВРеквизитФормы(ТаблицаFM, "ТаблицаТоваров");
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуТоваровВФоне()
			
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);	
	ИдентификаторЗадания = Неопределено;
	
	СтруктураПараметровПроцедуры = Новый Структура;	
	СтруктураПараметровПроцедуры.Вставить("НомерСчета", Объект.Номер);	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		
		АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
		// здесь должен быть вызов нашей процедуры
		РезультатВыполнения = Новый Структура("ЗаданиеВыполнено", Истина);
		
	Иначе
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
    	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Получить данные по товарам из FM'");		
		
		РезультатВыполнения  = ДлительныеОперации.ВыполнитьВФоне( 
		"УправлениеДокументамиСервер.ПолучитьТаблицуТоваровИзFM", 
		СтруктураПараметровПроцедуры, 
		ПараметрыВыполнения);	

	КонецЕсли;
		
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество; 
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Цена * ТекСтрока.Количество; 
КонецПроцедуры

&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	Режим = РежимДиалогаВопрос.ДаНет;
	Ответ = Вопрос("Изменить проект во всех строках табличной части?", Режим, 0);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат
	КонецЕсли; 
	
	Для Каждого СтрокаТЧ ИЗ Объект.Товары Цикл 
		СтрокаТЧ.Проект = Объект.Проект;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РаботаСФормамиКлиент.ОповеститьПослеЗаписиФормы("ЗаписьНаФорме", Объект.Ссылка, Новый Структура("Проект", Объект.Проект));
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Проект) Тогда
		Элемент.ТекущиеДанные.Проект = Объект.Проект;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Элемент.ТекущиеДанные.Количество) Тогда
		Элемент.ТекущиеДанные.Количество = 1;
	КонецЕсли;
КонецПроцедуры
